ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/TIMG8_1.0.xml
    <register id="TIMG8_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="TIMG8_COMMONREGS" name="TIMG8_COMMONREGS" instances="1" offset="0x1100" instaddr="0x2F" description="">
        <register id="TIMG8_CCPD" width="32" offset="0x0" description="CCP Direction">
            <bitfield id="C0CCP0" description="CCP0 direction" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
            <bitfield id="C0CCP1" description="CCP1 direction" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="INPUT" value="0x0" description="Input"/>
                <bitenum id="OUTPUT" value="0x1" description="Output"/>
            </bitfield>
        </register>
        <register id="TIMG8_ODIS" width="32" offset="0x4" description="Output Disable">
            <bitfield id="C0CCP0" description="Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[0] is forced low."/>
            </bitfield>
            <bitfield id="C0CCP1" description="Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CCP_OUTPUT_OCTL" value="0x0" description="Output function as selected by the OCTL register CCPO field are provided to output inversion block."/>
                <bitenum id="CCP_OUTPUT_LOW" value="0x1" description="CCP output occpout[1] is forced low."/>
            </bitfield>
        </register>
        <register id="TIMG8_CCLKCTL" width="32" offset="0x8" description="Counter Clock Control Register">
            <bitfield id="CLKEN" description="Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Clock is disabled."/>
                <bitenum id="ENABLED" value="0x1" description="Clock is enabled"/>
            </bitfield>
        </register>
        <register id="TIMG8_CPS" width="32" offset="0xC" description="Clock Prescale Register">
            <bitfield id="PCNT" description="Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG8_CPSV" width="32" offset="0x10" description="Clock prescale count status register">
            <bitfield id="CPSVAL" description="Current Prescale Count Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG8_CTTRIGCTL" width="32" offset="0x14" description="Timer Cross Trigger Control Register">
            <bitfield id="CTEN" description="Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTEN" description="Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTTRIGSEL" description="Used to Select the subscriber port that should be used for input cross trigger." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="FSUB0" value="0x0" description="Use FSUB0 as cross trigger source."/>
                <bitenum id="FSUB1" value="0x1" description="Use FSUB1 as cross trigger source."/>
                <bitenum id="Z" value="0x2" description="Use Zero event  as cross trigger source."/>
                <bitenum id="L" value="0x3" description="Use Load event as cross trigger source."/>
                <bitenum id="CCD0" value="0x4" description="Use CCD0 event  as cross trigger source."/>
                <bitenum id="CCD1" value="0x5" description="Use CCD1 event  as cross trigger source."/>
                <bitenum id="CCD2" value="0x6" description="Use CCD2 event  as cross trigger source."/>
                <bitenum id="CCD3" value="0x7" description="Use CCD3 event  as cross trigger source."/>
                <bitenum id="CCU0" value="0x8" description="Use CCU0 event  as cross trigger source."/>
                <bitenum id="CCU1" value="0x9" description="Use CCU1 event  as cross trigger source."/>
                <bitenum id="CCU2" value="0xA" description="Use CCU2 event  as cross trigger source."/>
                <bitenum id="CCU3" value="0xB" description="Use CCU3 event  as cross trigger source."/>
            </bitfield>
        </register>
